Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObjectAttribute.ObjectType Property
 The object type of the product.
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ObjectType { get; }
Public ReadOnly Property ObjectType As String
	Get
Property Value
Type: String
See Also
Reference
ReferenceModelObjectAttribute Class
Tekla.Structures.Model.Collaboration Namespace